:PROPERTIES:
:ID:       33cee19d-b67b-429c-963b-29209d0982bc
:END:
#+title: Orgmode

**** Initial values and caching

+ Header args are recursively merged and the values cached.
+ The value of header args is cached with each block (I think), retaining the
  value of the last invocation.
+ It seems that if no value is found and, if Babel seems to think a value is
  needed, that it runs the =emacs-lisp= code will run inside =#+PROPERTY:= lines.

This shows a notification any time it runs, but only changes the value of
=ecto-path= when it runs:

+ in a fresh emacs session (or maybe in a fresh buffer)
+ and only when the babel variable =ecto-path= doesn't have a value

#+begin_example org
#+PROPERTY: header-args:emacs-lisp+ :var ecto-path=(or (alert "foobarbaz") "a b c d" "d e f" (bound-and-true-p dc/ecto-path) dc/ecto-path)

#+name: foo
#+begin_src emacs-lisp
ecto-path
#+end_src

#+RESULTS: foo
: "a b c d"
#+end_example

It detects whether there is any cached value for =:var ecto-path= in the
block. A checksum for each block persists the identity of the block throughout
your emacs session:

